TexhFexLabs/HydroNodeStation/stm32_node/LoRaWAN/App/lora_app.c
  /* USER CODE END RestoreContext_1 */
  FLASH_IF_StatusTypedef ret_status = FLASH_IF_OK;
  switch (ctx_type)
  {
    case CONTEXT_MODEM:
      ret_status = FLASH_IF_Read(buffer, ADDR_FLASH_MODEM_CONTEXT, MODEM_CONTEXT_SIZE);
      break;
    case CONTEXT_LORAWAN_STACK:
      ret_status = FLASH_IF_Read(buffer, (void *)((uint32_t)(ADDR_FLASH_LORAWAN_CONTEXT + offset)), LORAWAN_CONTEXT_SIZE);
      break;
    case CONTEXT_SECURE_ELEMENT:
      ret_status = FLASH_IF_Read(buffer, ADDR_FLASH_SECURE_ELEMENT_CONTEXT, SECURE_ELEMENT_CONTEXT_SIZE);
      break;
    default:
      break;
  }
  if (ret_status != 0)
  {
    APP_LOG(TS_OFF, VLEVEL_M, "restore ctx type %d, FLASH_IF return: %d\r\n", ctx_type, ret_status);
  }
  /* USER CODE BEGIN RestoreContext_Last */

  /* USER CODE END RestoreContext_Last */
}

static void StoreContext(const modem_context_type_t ctx_type, uint32_t offset, const uint8_t *buffer,
                         const uint32_t size)
{
  /* USER CODE BEGIN StoreContext_1 */

  /* USER CODE END StoreContext_1 */
  FLASH_IF_StatusTypedef ret_status = FLASH_IF_OK;
  /* Offset is only used for fuota and store and forward purpose and for multistack features. To avoid ram consumption
   * the use of hal_flash_read_modify_write is only done in these cases */
  switch (ctx_type)
  {
    case CONTEXT_MODEM:
    {
      ret_status = FLASH_IF_Write(ADDR_FLASH_MODEM_CONTEXT, (const void *)buffer, MODEM_CONTEXT_SIZE);
    }

    break;
    case CONTEXT_LORAWAN_STACK:
    {
      ret_status = FLASH_IF_Write((void *)ADDR_FLASH_LORAWAN_CONTEXT, (const void *)buffer, (uint32_t)LORAWAN_CONTEXT_SIZE);
    }
    break;
    case CONTEXT_SECURE_ELEMENT:
    {
      ret_status = FLASH_IF_Write(ADDR_FLASH_SECURE_ELEMENT_CONTEXT, (const void *)buffer, SECURE_ELEMENT_CONTEXT_SIZE);
    }
    break;

    default:
      break;
  }
  if (ret_status != 0)
  {
    APP_LOG(TS_OFF, VLEVEL_M, "store ctx type %d, FLASH_IF return: %d\r\n", ctx_type, ret_status);
  }
  /* USER CODE BEGIN StoreContext_Last */

  /* USER CODE END StoreContext_Last */
}

static void EventCallback(void)
{
  smtc_modem_event_t current_event;
  uint8_t            event_pending_count;
  uint8_t            stack_id = STACK_ID;
  smtc_modem_status_mask_t status_mask = 0;

  /* Continue to read modem event until all event has been processed */
  do
  {
    /* Read modem event */
    ASSERT_SMTC_MODEM_RC(smtc_modem_get_event(&current_event, &event_pending_count));

    switch (current_event.event_type)
    {
      case SMTC_MODEM_EVENT_RESET:
        APP_LOG(TS_OFF, VLEVEL_M, "Event received: RESET\r\n");

        GetUniqueId(user_dev_eui);

        /* Set user credentials */
        ASSERT_SMTC_MODEM_RC(smtc_modem_set_deveui(stack_id, user_dev_eui));
        ASSERT_SMTC_MODEM_RC(smtc_modem_set_joineui(stack_id, user_join_eui));
        ASSERT_SMTC_MODEM_RC(smtc_modem_set_appkey(stack_id, user_gen_app_key));
        ASSERT_SMTC_MODEM_RC(smtc_modem_set_nwkkey(stack_id, user_app_key));

        /* Set user region */
        ASSERT_SMTC_MODEM_RC(smtc_modem_set_region(stack_id, ACTIVE_REGION));

        /* Print Security material */
        SecureElementPrintKeys(stack_id);
        CertMode = (smtc_modem_is_certification_port_disabled(STACK_ID)) ? 0 : CertMode;
        if (CertMode == false)
        {
          /* Schedule a Join LoRaWAN network */
          ASSERT_SMTC_MODEM_RC(smtc_modem_join_network(stack_id));
        }
        break;

      case SMTC_MODEM_EVENT_ALARM:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: ALARM\r\n");
        if (CertMode == true)
        {
          ASSERT_SMTC_MODEM_RC(smtc_modem_alarm_clear_timer());
        }
        else
        {
          /* Send periodical uplink */
          SendTxData(LORAWAN_USER_APP_PORT);
        }
        break;

      case SMTC_MODEM_EVENT_JOINED:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: JOINED\r\n");
        APP_LOG(TS_OFF, VLEVEL_H,  "Modem is now joined \r\n");
        /* USER CODE BEGIN EventCallback_1 */
        if (JoinLedTimer.IsRunning)
        {
          UTIL_TIMER_Stop(&JoinLedTimer);
          HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_RESET); /* LED_RED */
        }
        /* USER CODE END EventCallback_1 */
        if (CertMode == false)
        {
          /* Send first periodical uplink */
          SendTxData(LORAWAN_USER_APP_PORT);
        }
        break;

      case SMTC_MODEM_EVENT_TXDONE:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: TXDONE\r\n");
        APP_LOG(TS_OFF, VLEVEL_H,  "Transmission done \r\n");
        smtc_modem_get_status(STACK_ID, &status_mask);
        /* USER CODE BEGIN EventCallback_2 */
        /* Check if the device has already joined a network */
        if ((JoinLedTimer.IsRunning) && (status_mask & SMTC_MODEM_STATUS_JOINED) == SMTC_MODEM_STATUS_JOINED)
        {
          UTIL_TIMER_Stop(&JoinLedTimer);
          HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_RESET); /* LED_RED */
        }
        /* USER CODE END EventCallback_2 */
        break;

      case SMTC_MODEM_EVENT_DOWNDATA:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: DOWNDATA\r\n");
        /* USER CODE BEGIN EventCallback_3 */
        //HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_SET); /* LED_BLUE */
        UTIL_TIMER_Start(&RxLedTimer);
        /* USER CODE END EventCallback_3 */
        /* Get downlink data */
        ASSERT_SMTC_MODEM_RC(smtc_modem_get_downlink_data(rx_payload, &rx_payload_size, &rx_metadata, &rx_remaining));
        APP_LOG(TS_OFF, VLEVEL_M, "Data received on port %u\r\n", rx_metadata.fport);
        /* APP_LOG(TS_OFF, VLEVEL_M, "Received payload", rx_payload, rx_payload_size ); */
        break;

      case SMTC_MODEM_EVENT_JOINFAIL:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: JOINFAIL\r\n");
        smtc_modem_get_status(STACK_ID, &status_mask);
        /* USER CODE BEGIN EventCallback_4 */
        /* Check if the device has already joined a network */
        if ((!JoinLedTimer.IsRunning) && (status_mask & SMTC_MODEM_STATUS_JOINED) != SMTC_MODEM_STATUS_JOINED)
        {
          UTIL_TIMER_Start(&JoinLedTimer);
        }
        /* USER CODE END EventCallback_4 */
        break;

      case SMTC_MODEM_EVENT_ALCSYNC_TIME:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: ALCSync service TIME\r\n");
        break;

      case SMTC_MODEM_EVENT_LINK_CHECK:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: LINK_CHECK\r\n");
        break;

