TexhFexLabs/HydroNodeStation/stm32_node/LoRaWAN/App/lora_app.c
    if (((current_time_s - last_sps30_clean_timestamp) > (SPS30_FAN_CLEAN_INTERVAL_HOURS * 3600U)) &&
        (sensor_data.battery_voltage > 4120))
    {
      APP_LOG(TS_OFF, VLEVEL_M, "Manual SPS30 fan cleaning (VBat=%u mV)\r\n", (unsigned)sensor_data.battery_voltage);
      if (SPS30_StartFanCleaning() == SPS30_STATUS_OK)
      {
        last_sps30_clean_timestamp = current_time_s;
        UTIL_TIMER_Start(&Sps30CleanupTimer);
        cleaning_triggered = true;
      } else
      {
        APP_LOG(TS_OFF, VLEVEL_M, "Failed to start SPS30 fan cleaning\r\n");
      }
    }

    if (!cleaning_triggered)
    {
      (void)SPS30_StopMeasurement();
      (void)SPS30_Sleep();
    }
    CayenneLppAddLuminosity(LPP_CH_PM1_0,  sensor_data.pm1_0);
    CayenneLppAddLuminosity(LPP_CH_PM2_5,  sensor_data.pm2_5);
    CayenneLppAddLuminosity(LPP_CH_PM4_0,  sensor_data.pm4_0);
    CayenneLppAddLuminosity(LPP_CH_PM10_0, sensor_data.pm10_0);
  }

  CayenneLppCopy(AppDataBuffer);
  bufferSize = CayenneLppGetSize();

  if (JoinLedTimer.IsRunning)
  {
    UTIL_TIMER_Stop(&JoinLedTimer);
    HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_RESET);
  }

  ASSERT_SMTC_MODEM_RC(smtc_modem_request_uplink(STACK_ID, port, false, AppDataBuffer, bufferSize));

  if (EventType == TX_ON_TIMER)
  {
    smtc_modem_status_mask_t status_mask = 0;
    smtc_modem_get_status(STACK_ID, &status_mask);
    uint32_t dutycycle = (CertMode || ((status_mask & SMTC_MODEM_STATUS_JOINED) != SMTC_MODEM_STATUS_JOINED)) ? CERT_TX_DUTYCYCLE : APP_TX_DUTYCYCLE;

    ASSERT_SMTC_MODEM_RC(smtc_modem_alarm_start_timer(dutycycle));

    /* Schedule pre-measurement for next TX if it will be a cycle for CO2 or SPS30 */
    uint8_t next_counter = (tx_counter % 6U) + 1U;
    if (next_counter % 3U == 0U)
    {
      UTIL_TIMER_SetPeriod(&Scd41Timer, (dutycycle * 1000U) - SCD41_PRE_MEASUREMENT_TIME_MS);
      UTIL_TIMER_Start(&Scd41Timer);
    }

    if (next_counter % 6U == 0U)
    {
      UTIL_TIMER_SetPeriod(&Sps30Timer, (dutycycle * 1000U) - SPS30_PRE_MEASUREMENT_TIME_MS);
      UTIL_TIMER_Start(&Sps30Timer);
    }
  }
  /* USER CODE END SendTxData_1 */
}

/* USER CODE BEGIN PrFD_LedEvents */
static bool IsAllZero(const uint8_t *buffer, uint8_t size)
{
  for (uint8_t i = 0; i < size; i++)
  {
    if (buffer[i] != 0U)
    {
      return false;
    }
  }

  return true;
}

static void OnTxTimerLedEvent(void *context)
{
  HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_RESET); /* LED_GREEN */
}

static void OnRxTimerLedEvent(void *context)
{
  //HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_RESET); /* LED_BLUE */
}

static void OnJoinTimerLedEvent(void *context)
{
  HAL_GPIO_TogglePin(LED3_GPIO_Port, LED3_Pin); /* LED_RED */
}

static void OnScd41TimerEvent(void *context)
{
  APP_LOG(TS_ON, VLEVEL_M, "SCD41 pre-measurement started\r\n");
  EnvSensors_StartPreMeasurement(SENSOR_FLAG_CO2);
}

static void OnSps30TimerEvent(void *context)
{
  APP_LOG(TS_ON, VLEVEL_M, "SPS30 pre-measurement started\r\n");
  EnvSensors_StartPreMeasurement(SENSOR_FLAG_SPS30);
}

static void OnSps30CleanupTimerEvent(void *context)
{
  APP_LOG(TS_ON, VLEVEL_M, "SPS30 cleaning finished, going to sleep\r\n");
  (void)SPS30_StopMeasurement();
  (void)SPS30_Sleep();
}

/* USER CODE END PrFD_LedEvents */

#if defined (LOW_POWER_DISABLE) && (LOW_POWER_DISABLE == 0)
static void OnSleepTimerEvent(void *context)
{
  /* USER CODE BEGIN OnSleepTimerEvent_1 */

  /* USER CODE END OnSleepTimerEvent_1 */
  APP_LOG(TS_ON, VLEVEL_H, "Sleep timer\r\n");

  /* USER CODE BEGIN OnSleepTimerEvent_Last */

  /* USER CODE END OnSleepTimerEvent_Last */
}
#endif /*(LOW_POWER_DISABLE) && (LOW_POWER_DISABLE == 0) */

/* --- EOF ------------------------------------------------------------------ */
